app/Controllers/Auth/Auth.php

    public function login()
    {
        $npm = $this->request->getVar('npm');
        $password = $this->request->getVar('password');
        $user = $this->userModel->where('npm', $npm)->first();
---
SELECT *
FROM `user`
WHERE `npm` = '2'
 LIMIT 1