app/Controllers/Admin/Search.php

    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $result = $this->transaksiModel
                ->join('user', 'user.npm = transaksi.npm')
                ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                ->join('role', 'role.id_role = user.id_role')
                ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                ->orderBy('transaksi.id_transaksi', 'DESC')
                ->like('user.npm', $keyword)
                ->orLike('transaksi.kodebooking_transaksi', $keyword)
                ->orLike('kartu.nomor_kartu', $keyword)
                ->orLike('user.nama', $keyword)
                ->orLike('transaksi.updated_at', $keyword)
                ->findAll();

            // Cek apakah hasil pencarian tidak kosong
            if (!empty($result)) {
                $data = [
                    'title' => 'Parking Management System',
                    'user' => $this->userModel
                        ->join('role', 'role.id_role = user.id_role')
                        ->where('npm', session('npm'))
                        ->first(),
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1