app/Controllers/Admin/User.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `role`
---
    public function userCreate()
    {
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first(),
                'role' => $this->roleModel->findAll()

INSERT INTO `kartu` (`nomor_kartu`, `saldo`, `created_at`, `updated_at`) VALUES ('000664354678', '0', '2023-06-20 21:29:46', '2023-06-20 21:29:46')
---
        $password = $npm;

        // Jika berhasil, simpan data ke database
        $this->kartuModel->save(
            [
                'nomor_kartu' => $this->request->getVar('nomor_kartu'),
                'saldo' => $this->request->getVar('saldo'),
            ]
        );

INSERT INTO `user` (`npm`, `id_kartu`, `id_role`, `id_status`, `nama`, `email`, `password`, `masa_berlaku`, `created_at`, `updated_at`) VALUES ('2021320063', 70, '4', '2', 'Agustinus', 'akutampan@gmail.com', '0e0931a27e7d64557725cbe098803825', '2023-06-22', '2023-06-20 21:29:46', '2023-06-20 21:29:46')
---
                'id_status'  => $this->request->getVar('id_status'),
                'masa_berlaku'=> $this->request->getVar('masa_berlaku'),
            ];
        $this->userModel->insert($datauser);

SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
---
    public function userRead()
    {
        $limit = 9; // Jumlah item per halaman
        $currentPage = $this->request->getVar('page_pagination') ? $this->request->getVar('page_pagination') : 1;
        $totalRows = $this->userModel->countAllResults();

        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(),
            'users' => $this->userModel->join('kartu', 'kartu.id_kartu = user.id_kartu')->paginate($limit, 'pagination'),

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
---
    public function userDelete($npm)
    {
        $this->userModel->where('npm', $npm)->delete();

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `status` ON `status`.`id_status` = `user`.`id_status`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '2021320035'
 LIMIT 1
UPDATE `user` SET `nama` = 'Zaky Abdurrahman', `email` = 'zakyabdrr1@gmail.com', `id_role` = '4', `id_status` = '2', `masa_berlaku` = '2023-07-21', `updated_at` = '2023-06-21 09:55:59'
WHERE `user`.`npm` IN ('2021320035')
UPDATE `kartu` SET `nomor_kartu` = '0003648430', `saldo` = '20000', `updated_at` = '2023-06-21 09:55:59'
WHERE `kartu`.`id_kartu` IN ('82')
---
    public function userEdit($npm)
    {
        $data = $this->request->getPost();
        $user = $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->join('status', 'status.id_status = user.id_status')
            ->join('kartu', 'kartu.id_kartu = user.id_kartu')
            ->where('npm', $npm)
            ->first();

        if ($user) {
            $this->userModel->update($user['npm'], $data); // Menggunakan id dari user untuk update data
            session()->setFlashdata('berhasil', '<br>');

            // Misalkan Anda ingin juga melakukan update pada model kartu
            $this->kartuModel->update($user['id_kartu'], $data); // Menggunakan id_kartu dari user untuk update data pada model kartu