BACKUP/app/Controllers/Admin/Transaksi.php

    public function transaksi_result($booking_code, $nominal_saldo)
    {
        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(),
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1