BACKUP/app/Controllers/Admin/User.php

    public function userRead()
{
    $limit = 9; // Jumlah item per halaman
    $currentPage = $this->request->getVar('page_pagination') ? $this->request->getVar('page_pagination') : 1;
    $totalRows = $this->userModel->countAllResults();

    $data = [
        'title' => 'Parking Management System',
        'user' => $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->where('npm', session('npm'))
            ->first(),
        'users' => $this->userModel->join('kartu', 'kartu.id_kartu = user.id_kartu')->paginate($limit, 'pagination'),
---
SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`